# Group by in pandas

In [1]:
import pandas as pd

In [3]:
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
d

   name  subject1  subject2
0     a        12        23
1     b        13        24
2     c        14        25
3     d        12        26
4     a        13        27
5     b        14        28
6     a        15        29
7     b        23        30
8     a        25        25
9     c        16        34
10    c        10        35
11    d        11        26

In [5]:
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
var_new = d.groupby("name")#this will group by name for example a will be show, then b data will be show, then c ,then d,..so on

var_new #it will show that groupby is done successfully

In [9]:
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
var_new = d.groupby("name") #this will group by name for example a will be show, then b data will be show, then c ,then d,..so on

#to see groupby data successfully
for x,y in var_new:
    print(x)
    print(y)
    print()

a
  name  subject1  subject2
0    a        12        23
4    a        13        27
6    a        15        29
8    a        25        25

b
  name  subject1  subject2
1    b        13        24
5    b        14        28
7    b        23        30

c
   name  subject1  subject2
2     c        14        25
9     c        16        34
10    c        10        35

d
   name  subject1  subject2
3     d        12        26
11    d        11        26

In [13]:
#to fatch only data starts with particular name 
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
var_new = d.groupby("name") #this will group by name for example a will be show, then b data will be show, then c ,then d,..so on
#to see groupby data successfully

var_new.get_group('a') #to fatch only data with a

  name  subject1  subject2
0    a        12        23
4    a        13        27
6    a        15        29
8    a        25        25

In [15]:
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
var_new = d.groupby("name")
var_new.min()   #it will show only minimun data of a ,b,c,d

      subject1  subject2
name
a           12        23
b           13        24
c           10        25
d           11        26

In [16]:
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
var_new = d.groupby("name")
var_new.max()   #it will show only maximun data of a ,b,c,d

      subject1  subject2
name
a           25        29
b           23        30
c           16        35
d           12        26

In [17]:
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
var_new = d.groupby("name")
var_new.mean()   #it will count and then show mean data of a ,b,c,d

       subject1   subject2
name
a     16.250000  26.000000
b     16.666667  27.333333
c     13.333333  31.333333
d     11.500000  26.000000

In [21]:
#to convert dataframe to list
d = pd.DataFrame({"name":['a','b','c','d','a','b','a','b','a','c','c','d'],"subject1":[12,13,14,12,13,14,15,23,25,16,10,11],"subject2":[23,24,25,26,27,28,29,30,25,34,35,26]})
var_new = d.groupby("name")
l = list(var_new)
l

[('a',
    name  subject1  subject2
  0    a        12        23
  4    a        13        27
  6    a        15        29
  8    a        25        25),
 ('b',
    name  subject1  subject2
  1    b        13        24
  5    b        14        28
  7    b        23        30),
 ('c',
     name  subject1  subject2
  2     c        14        25
  9     c        16        34
  10    c        10        35),
 ('d',
     name  subject1  subject2
  3     d        12        26
  11    d        11        26)]